title: Executable File Created In Writable Special Directory
id: 8b4c65e8-4b8a-4f0a-9f2f-a1bbd8d5856c
status: experimental
description: Detects creation of executable/script files in writable special directories such as Users Public and ProgramData.
author: ThreatGraph
date: 2026-02-27
references:
  - https://attack.mitre.org/techniques/T1105/
tags:
  - attack.defense-evasion
  - attack.persistence
  - attack.t1105
logsource:
  product: windows
  service: sysmon
  category: file_event
detection:
  sel_writable_roots:
    TargetFilename|startswith:
      - 'C:\Users\Public\'
      - 'C:\ProgramData\'
  sel_temp_roots:
    TargetFilename|contains:
      - '\AppData\Local\Temp\'
      - '\Windows\Temp\'
  sel_exec_ext:
    TargetFilename|endswith:
      - '.exe'
      - '.dll'
      - '.sys'
      - '.com'
      - '.bat'
      - '.cmd'
      - '.ps1'
      - '.vbs'
      - '.js'
  filter_main_known_cache:
    TargetFilename|contains:
      - '\Package Cache\'
      - '\Microsoft\Windows Defender\'
  filter_main_msedge_unpacker:
    TargetFilename|contains:
      - '\AppData\Local\Temp\msedge_chrome_unpacker_'
      - '\AppData\Local\Temp\msedgebits\'
      - '\AppData\Local\Temp\edge_bits\'
  condition: (sel_writable_roots or sel_temp_roots) and sel_exec_ext and not 1 of filter_main_*
falsepositives:
  - Legitimate software installers and updaters
level: medium
